
Hi All,

Hopefully you can help us understand why we get a cycle error in the following case;

We have an API deployed that has a single method (e.g. "ANY") and single corresponding integration. This needs to be changed to two methods (e.g. "ANY" and "OPTIONS") and two integrations. Our actual implementation is quite complex but after extensive testing we think the change that is causing the error can be reproduced using the example @bflad provided above on 22 Jan.

Steps to reproduce:

1. Apply the example configuration:

`
resource "aws_api_gateway_rest_api" "example" {
  name = "example"
}
resource "aws_api_gateway_resource" "example" {
  parent_id   = aws_api_gateway_rest_api.example.root_resource_id
  path_part   = "example"
  rest_api_id = aws_api_gateway_rest_api.example.id
}
resource "aws_api_gateway_method" "example" {
  authorization = "NONE"
  http_method   = "GET"
  resource_id   = aws_api_gateway_resource.example.id
  rest_api_id   = aws_api_gateway_rest_api.example.id
}
resource "aws_api_gateway_integration" "example" {
  http_method = aws_api_gateway_method.example.http_method
  resource_id = aws_api_gateway_resource.example.id
  rest_api_id = aws_api_gateway_rest_api.example.id
  type        = "MOCK"
}
resource "aws_api_gateway_deployment" "example" {
  rest_api_id = aws_api_gateway_rest_api.example.id
triggers = {
    # NOTE: The configuration below will satisfy ordering considerations,
    #       but not pick up all future REST API changes. More advanced patterns
    #       are possible, such as using the filesha1() function against the
    #       Terraform configuration file(s) or removing the .id references to
    #       calculate a hash against whole resources. Be aware that using whole
    #       resources will show a difference after the initial implementation.
    #       It will stabilize to only change when resources change afterwards.
    redeployment = sha1(jsonencode([
      aws_api_gateway_resource.example.id,
      aws_api_gateway_method.example.id,
      aws_api_gateway_integration.example.id,
    ]))
  }
lifecycle {
    create_before_destroy = true
  }
}
resource "aws_api_gateway_stage" "example" {
  deployment_id = aws_api_gateway_deployment.example.id
  rest_api_id   = aws_api_gateway_rest_api.example.id
  stage_name    = "example"
}

`
2. Modify the configuration by changing the name of the method from "example" to "new_example" and modify the integration and deployment resources accordingly:

`resource "aws_api_gateway_rest_api" "example" {
  name = "example"
}
resource "aws_api_gateway_resource" "example" {
  parent_id   = aws_api_gateway_rest_api.example.root_resource_id
  path_part   = "example"
  rest_api_id = aws_api_gateway_rest_api.example.id
}
resource "aws_api_gateway_method" "new_example" {
  authorization = "NONE"
  http_method   = "GET"
  resource_id   = aws_api_gateway_resource.example.id
  rest_api_id   = aws_api_gateway_rest_api.example.id
}
resource "aws_api_gateway_integration" "example" {
  http_method = aws_api_gateway_method.new_example.http_method
  resource_id = aws_api_gateway_resource.example.id
  rest_api_id = aws_api_gateway_rest_api.example.id
  type        = "MOCK"
}
resource "aws_api_gateway_deployment" "example" {
  rest_api_id = aws_api_gateway_rest_api.example.id
triggers = {
    # NOTE: The configuration below will satisfy ordering considerations,
    #       but not pick up all future REST API changes. More advanced patterns
    #       are possible, such as using the filesha1() function against the
    #       Terraform configuration file(s) or removing the .id references to
    #       calculate a hash against whole resources. Be aware that using whole
    #       resources will show a difference after the initial implementation.
    #       It will stabilize to only change when resources change afterwards.
    redeployment = sha1(jsonencode([
      aws_api_gateway_resource.example.id,
      aws_api_gateway_method.new_example.id,
      aws_api_gateway_integration.example.id,
    ]))
  }
lifecycle {
    create_before_destroy = true
  }
}
resource "aws_api_gateway_stage" "example" {
  deployment_id = aws_api_gateway_deployment.example.id
  rest_api_id   = aws_api_gateway_rest_api.example.id
  stage_name    = "example"
}`

3. Apply the updated configuration.

Plan produced:

`aws_api_gateway_method.example: Refreshing state... [id=agm-lmlxra33ia-qelyhd-GET]
aws_api_gateway_rest_api.example: Refreshing state... [id=lmlxra33ia]
aws_api_gateway_resource.example: Refreshing state... [id=qelyhd]
aws_api_gateway_integration.example: Refreshing state... [id=agi-lmlxra33ia-qelyhd-GET]
aws_api_gateway_deployment.example: Refreshing state... [id=bijh9t]
aws_api_gateway_stage.example: Refreshing state... [id=ags-lmlxra33ia-example]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.example must be replaced
+/- resource "aws_api_gateway_deployment" "example" {
      ~ created_date  = "2021-03-19T16:38:28Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:eu-west-1:761119411229:lmlxra33ia/" -> (known after apply)
      ~ id            = "bijh9t" -> (known after apply)
      ~ invoke_url    = "https://lmlxra33ia.execute-api.eu-west-1.amazonaws.com/" -> (known after apply)
        rest_api_id   = "lmlxra33ia"
      ~ triggers      = {
          - "redeployment" = "d999035c77e6072f5978c7bb04bdc2da8308297e"
        } -> (known after apply) # forces replacement
    }

  # aws_api_gateway_method.example will be destroyed
  - resource "aws_api_gateway_method" "example" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-lmlxra33ia-qelyhd-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "qelyhd" -> null
      - rest_api_id          = "lmlxra33ia" -> null
    }

  # aws_api_gateway_method.new_example will be created
  + resource "aws_api_gateway_method" "new_example" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = "qelyhd"
      + rest_api_id      = "lmlxra33ia"
    }

  # aws_api_gateway_stage.example will be updated in-place
  ~ resource "aws_api_gateway_stage" "example" {
        arn                   = "arn:aws:apigateway:eu-west-1::/restapis/lmlxra33ia/stages/example"
        cache_cluster_enabled = false
      ~ deployment_id         = "bijh9t" -> (known after apply)
        execution_arn         = "arn:aws:execute-api:eu-west-1:761119411229:lmlxra33ia/example"
        id                    = "ags-lmlxra33ia-example"
        invoke_url            = "https://lmlxra33ia.execute-api.eu-west-1.amazonaws.com/example"
        rest_api_id           = "lmlxra33ia"
        stage_name            = "example"
        tags                  = {}
        variables             = {}
        xray_tracing_enabled  = false
    }

Plan: 2 to add, 1 to change, 2 to destroy.`

Expected behaviour: A new deployment is created and the old deployment is replaced.

Actual behaviour:
`Error: Cycle: aws_api_gateway_stage.example, aws_api_gateway_method.example (destroy), aws_api_gateway_deployment.example, aws_api_gateway_deployment.example (destroy deposed d932d47f)`

We would really appreciate it if you could look into this case. 

Thank you